class Level_01:
    def __init__(self):
        self.name = "Desert"
        self.speed = 7
        self.snake_start = [(400, 300)]
        self.foods = [(300, 200), (500, 400), (200, 500), (600, 100)]
        self.walls = [
            (0, 0, 800, 20),      # верхняя стена
            (0, 580, 800, 20),    # нижняя стена
            (0, 0, 20, 600),      # левая стена
            (780, 0, 20, 600),    # правая стена
            (350, 200, 100, 200)  # внутренняя стена
        ]
        self.background_color = (80, 60, 30)